/*
Студент Сергій хоче купити Unlim підписку в Mate academy, але в нього не вистачає грошей. 
Тому він звернувся в Mate bank, який видає кредити під 10% річних і дозволяє виплачувати тіло та відсотки одним платежем в кінці строку.

Якщо брати 1600$ на 3 роки, то в кінці треба заплатити 2129.6$. Але Сергій планував вкластися в 2000. 
Перерахувавши знову, банкір сказав, що Сергій може взяти кредит на 2 роки, тоді він заплатить лише 1936$.

1600 + 10% = 1760 (160$ відсотки за 1-ий рік)
1760 + 10% = 1936 (176$ відсотки за 2-ий рік)
Давай створимо функцію getYears, яка за розміром кредита amount, річним відсотком percent та обмеженням клієнта limit обчислить максимальний термін кредита (ціла кількість років)

Приклади:

getYears(1600, 10, 2000) === 2 1600 + 160 + 176 < 2000;
getYears(500, 3, 550) === 3
*/

function getYears(amount, annualPercentage, limit) {
    let years = 0; 
    let currentAmount = amount; 
    while (currentAmount <= limit) {
        years++;
        currentAmount += currentAmount * (annualPercentage / 100);
    }
    return years - 1;
}
