/*
Створи функцію multiply.
Передай у функцію параметри a та b.
Поверни із функції добуток її параметрів.
Якщо параметр b не передано у функцію, використовуй 1, як значення за замовчуванням.
Приклад:

multiply(5, 10) === 50
multiply(24) === 24
*/

/*
Создай функцию multiply.
Передайте в функцию параметры a и b.
Верни из функции произведение ее параметров.
Если параметр b не передан в функцию, используй 1 в качестве значения по умолчанию.
Пример:

multiply(5, 10) === 50
multiply(24) === 24
*/

function multiply(a, b = 1) {
    return a * b;
}