/*
Оголоси змінні та присвой їм цифрові значення в різних системах числення:
*/

/* змінну myBin з двійковим значенням, еквівалентним 10 в десятковій системі числення (1010) */
const myBin = 0b1010;
/* змінну myOct з вісімковим значенням, еквівалентним 20 в десятковій системі числення (24) */
const myOct = 0o24;
/* змінну myDec зі значенням 30 в десятковій системі числення */
const myDec = 30;
/* змінну myHex з шістнадцятковим значенням, еквівалентним 40 в десятковій системі числення (28) */
const myHex = 0x28;