/*
Напиши функцію getProductId, яка приймає рядок, що представляє собою URL-адресу сторінки цього товару у вашому Інтернет-магазині і повертає ідентифікатор товару з рядка.

Усі URL-адреси відформатовані однаково, спочатку є домен exampleshop.com, 
потім у нас іде назва товару, розділена тире (-), потім іде буква p, що вказує на початок ідентифікатора товару, 
потім фактичний ідентифікатор (без обмеження довжини) і, нарешті, 8-значне представлення дати, коли товар було додано, а потім - .html.

Примітки:

Назва товару також може містити літеру p або цифри.
Ваш код повинен повернути ідентифікатор продукту у вигляді рядка.
Усі URL-адреси будуть дійсними URL-адресами продуктів, і всі будуть відповідати вищевказаній структурі.
*/

function getProductId(line) {
    const match = line.match(/-P(\d+)-\d{8}\.html$/);
    if (match) {
        return match[1];
    }
    throw new Error("Invalid URL format");
}
