/*
На складі комп'ютерних запчастин Mate warehouse є коробки з різними видами запчастин. 
У кожній коробці лежить деталь, відповідно до назви коробки. 
Наприклад в коробці memory лежить оперативна пам'ять, в коробці processors лежать процесори і так далі. Комірникові потрібно знати де що зберігається.

Створи об'єкт warehouse, в якому будуть властивості (коробки), що відповідають трьом типам деталей ( memory, processors, displays). 
Зараз у нас на складі 10 процесорів, 20 дисплеїв і 15 планок оперативної пам'ят
*/

const warehouse = {
    memory: 15,
    processors: 10,
    displays: 20
};
